# ReverseIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EdgeArray..::..ReverseIterator Method
EdgeArray Class See Also
---
Retrieve a backward moving iterator to the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual EdgeArrayIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overridable Function ReverseIterator As EdgeArrayIterator
```

Visual C++
---
```text
public:
virtual EdgeArrayIterator^ ReverseIterator()
```

# ### Return Value
Returns a backward moving iterator to the array.
# See Also
EdgeArray Class
Autodesk.Revit.DB Namespace